--- code/crates/nestgate-core/src/config/federation.rs
+++ replace FederationConfig::mode -> &str with "xyzzy"
@@ -203,17 +203,17 @@
 
     /// Get cluster name
     pub fn cluster_name(&self) -> &str {
         &self.cluster_name
     }
 
     /// Get federation mode
     pub fn mode(&self) -> &str {
-        &self.mode
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get peer nodes
     pub fn peers(&self) -> &[String] {
         &self.peers
     }
 
     /// Add a peer node
