--- code/crates/nestgate-core/src/biomeos.rs
+++ replace parse_size -> Result<u64> with Ok(1)
@@ -698,61 +698,10 @@
                 is_bug: false,
             }),
         }
     }
 }
 
 /// Parse size string to bytes
 fn parse_size(size_str: &str) -> Result<u64> {
-    let size_str = size_str.trim();
-
-    if size_str.ends_with("Gi") || size_str.ends_with("gi") {
-        let num_str = &size_str[..size_str.len() - 2];
-        let num: f64 = num_str
-            .parse()
-            .map_err(|_parse_err| crate::NestGateError::Validation {
-                field: "size_format".to_string(),
-                message: format!("Invalid size format: {size_str}"),
-                current_value: Some(size_str.to_string()),
-                expected: Some("Valid format: <number>Gi (e.g., '4.5Gi')".to_string()),
-                user_error: true,
-            })?;
-        Ok((num * 1024.0 * 1024.0 * 1024.0) as u64)
-    } else if size_str.ends_with("Ti") || size_str.ends_with("ti") {
-        let num_str = &size_str[..size_str.len() - 2];
-        let num: f64 = num_str
-            .parse()
-            .map_err(|_parse_err| crate::NestGateError::Validation {
-                field: "size_format".to_string(),
-                message: format!("Invalid size format: {size_str}"),
-                current_value: Some(size_str.to_string()),
-                expected: Some("Valid format: <number>Ti (e.g., '2.5Ti')".to_string()),
-                user_error: true,
-            })?;
-        Ok((num * 1024.0 * 1024.0 * 1024.0 * 1024.0) as u64)
-    } else if size_str.ends_with("Mi") || size_str.ends_with("mi") {
-        let num_str = &size_str[..size_str.len() - 2];
-        let num: f64 = num_str
-            .parse()
-            .map_err(|_parse_err| crate::NestGateError::Validation {
-                field: "size_format".to_string(),
-                message: format!("Invalid size format: {size_str}"),
-                current_value: Some(size_str.to_string()),
-                expected: Some("Valid format: <number>Mi (e.g., '512Mi')".to_string()),
-                user_error: true,
-            })?;
-        Ok((num * 1024.0 * 1024.0) as u64)
-    } else {
-        // Assume bytes if no suffix
-        size_str
-            .parse()
-            .map_err(|_parse_err| crate::NestGateError::Validation {
-                field: "size_format".to_string(),
-                message: format!("Invalid size format: {size_str}"),
-                current_value: Some(size_str.to_string()),
-                expected: Some(
-                    "Valid format: number, <number>Mi, <number>Gi, or <number>Ti".to_string(),
-                ),
-                user_error: true,
-            })
-    }
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }
