--- code/crates/nestgate-core/src/biomeos.rs
+++ replace * with / in parse_size
@@ -723,17 +723,17 @@
             .parse()
             .map_err(|_parse_err| crate::NestGateError::Validation {
                 field: "size_format".to_string(),
                 message: format!("Invalid size format: {size_str}"),
                 current_value: Some(size_str.to_string()),
                 expected: Some("Valid format: <number>Ti (e.g., '2.5Ti')".to_string()),
                 user_error: true,
             })?;
-        Ok((num * 1024.0 * 1024.0 * 1024.0 * 1024.0) as u64)
+        Ok((num / /* ~ changed by cargo-mutants ~ */ 1024.0 * 1024.0 * 1024.0 * 1024.0) as u64)
     } else if size_str.ends_with("Mi") || size_str.ends_with("mi") {
         let num_str = &size_str[..size_str.len() - 2];
         let num: f64 = num_str
             .parse()
             .map_err(|_parse_err| crate::NestGateError::Validation {
                 field: "size_format".to_string(),
                 message: format!("Invalid size format: {size_str}"),
                 current_value: Some(size_str.to_string()),
