--- code/crates/nestgate-core/src/biomeos.rs
+++ replace - with / in parse_size
@@ -725,17 +725,17 @@
                 field: "size_format".to_string(),
                 message: format!("Invalid size format: {size_str}"),
                 current_value: Some(size_str.to_string()),
                 expected: Some("Valid format: <number>Ti (e.g., '2.5Ti')".to_string()),
                 user_error: true,
             })?;
         Ok((num * 1024.0 * 1024.0 * 1024.0 * 1024.0) as u64)
     } else if size_str.ends_with("Mi") || size_str.ends_with("mi") {
-        let num_str = &size_str[..size_str.len() - 2];
+        let num_str = &size_str[..size_str.len() / /* ~ changed by cargo-mutants ~ */ 2];
         let num: f64 = num_str
             .parse()
             .map_err(|_parse_err| crate::NestGateError::Validation {
                 field: "size_format".to_string(),
                 message: format!("Invalid size format: {size_str}"),
                 current_value: Some(size_str.to_string()),
                 expected: Some("Valid format: <number>Mi (e.g., '512Mi')".to_string()),
                 user_error: true,
