--- code/crates/nestgate-core/src/config/security.rs
+++ replace && with || in SecurityConfig::is_decentralized_security_enabled
@@ -442,17 +442,17 @@
             max_connections_per_ip: 10, // Maximum 10 concurrent connections per IP
         }
     }
 }
 
 impl SecurityConfig {
     /// Check if decentralized security authentication is enabled
     pub fn is_decentralized_security_enabled(&self) -> bool {
-        self.auth_method == "decentralized" && self.decentralized_security.is_some()
+        self.auth_method == "decentralized" || /* ~ changed by cargo-mutants ~ */ self.decentralized_security.is_some()
     }
 
     /// Check if TLS is enabled
     pub fn is_tls_enabled(&self) -> bool {
         self.tls.is_some()
     }
 
     /// Check if RBAC is enabled
