--- code/crates/nestgate-core/src/config/storage_constants.rs
+++ delete match arm "max_file" in StorageConstants::get_file_size
@@ -287,17 +287,17 @@
         Self::default()
     }
 
     /// Get a file size constant by name
     pub fn get_file_size(&self, size_type: &str) -> Option<u64> {
         match size_type {
             "small_file" => Some(self.file_sizes.small_file),
             "large_file" => Some(self.file_sizes.large_file),
-            "max_file" => Some(self.file_sizes.max_file_size),
+             /* ~ changed by cargo-mutants ~ */
             "archive_threshold" => Some(self.file_sizes.archive_threshold),
             _ => None,
         }
     }
 
     /// Get a memory limit by name
     pub fn get_memory_limit(&self, limit_type: &str) -> Option<u64> {
         match limit_type {
