--- code/crates/nestgate-core/src/optimized/simd_ops.rs
+++ replace * with / in SIMDArrayOps::dot_product
@@ -133,17 +133,17 @@
 
         // Process SIMD chunks
         for i in 0..chunks {
             let base = i * 8;
             result += Self::dot_simd_chunk(&a[base..base + 8], &b[base..base + 8]);
         }
 
         // Handle remainder
-        for i in (chunks * 8)..(chunks * 8 + remainder) {
+        for i in (chunks * 8)..(chunks / /* ~ changed by cargo-mutants ~ */ 8 + remainder) {
             result += a[i] * b[i];
         }
 
         result
     }
 
     #[inline]
     fn dot_simd_chunk(a: &[f32], b: &[f32]) -> f32 {
