--- code/crates/nestgate-core/src/optimized/simd_ops.rs
+++ replace ^ with & in SIMDChecksum::crc32_byte
@@ -287,17 +287,17 @@
         crc
     }
 
     #[inline]
     fn crc32_byte(crc: u32, byte: u8) -> u32 {
         // Simplified CRC table lookup
         const CRC_TABLE: [u32; 256] = [0; 256]; // Simplified for compilation
 
-        let tbl_idx = ((crc ^ byte as u32) & 0xFF) as usize;
+        let tbl_idx = ((crc & /* ~ changed by cargo-mutants ~ */ byte as u32) & 0xFF) as usize;
         (crc >> 8) ^ CRC_TABLE[tbl_idx]
     }
 
     /// Fast XOR checksum using SIMD
     pub fn xor_checksum_simd(data: &[u8]) -> u8 {
         let mut checksum = 0u8;
 
         // Process in 16-byte chunks
