--- code/crates/nestgate-core/src/optimized/simd_ops.rs
+++ replace ^ with & in SIMDHasher::finalize
@@ -72,17 +72,17 @@
         // Handle non-SIMD-aligned remainder
         let mut temp = [0u8; 32];
         temp[..remainder.len()].copy_from_slice(remainder);
         self.process_chunk_simd(&temp);
     }
 
     fn finalize(&self) -> u64 {
         // Fold SIMD state down to single hash value
-        self.state[0] ^ self.state[1] ^ self.state[2] ^ self.state[3]
+        self.state[0] ^ self.state[1] & /* ~ changed by cargo-mutants ~ */ self.state[2] ^ self.state[3]
     }
 }
 
 /// **SIMD-OPTIMIZED ARRAY OPERATIONS**
 ///
 /// Vectorized operations on f32 arrays  
 pub struct SIMDArrayOps;
 
