--- code/crates/nestgate-core/src/optimized/zero_copy_traits.rs
+++ replace Config<'a>::data -> &ConfigData with Box::leak(Box::new(Default::default()))
@@ -552,20 +552,17 @@
 
     /// Create from owned data (single allocation)
     pub fn from_owned(data: ConfigData) -> Self {
         Config::Owned(Box::new(data))
     }
 
     /// Get reference to data (zero-copy)
     pub fn data(&self) -> &ConfigData {
-        match self {
-            Config::Borrowed(data) => data,
-            Config::Owned(data) => data,
-        }
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Convert to owned version if not already
     pub fn into_owned(self) -> Config<'static> {
         match self {
             Config::Borrowed(data) => Config::Owned(Box::new(ConfigData {
                 name: data.name.clone(),
                 value: data.value.clone(),
