--- code/crates/nestgate-core/src/performance.rs
+++ replace / with * in PerformanceMetrics::average_batched_latency
@@ -293,17 +293,17 @@
         } else {
             Duration::ZERO
         }
     }
 
     /// Calculate average latency for batched operations
     pub fn average_batched_latency(&self) -> Duration {
         if self.batched_operations > 0 {
-            self.total_batched_time / self.batched_operations as u32
+            self.total_batched_time * /* ~ changed by cargo-mutants ~ */ self.batched_operations as u32
         } else {
             Duration::ZERO
         }
     }
 
     /// Calculate performance improvement from batching
     pub fn batching_improvement(&self) -> f64 {
         if self.individual_operations > 0 && self.batched_operations > 0 {
