--- code/crates/nestgate-core/src/service_discovery.rs
+++ replace ServiceRegistry::select_service -> Option<ServiceEndpoint> with Some(Default::default())
@@ -256,25 +256,17 @@
                     .cloned()
                     .collect()
             })
             .unwrap_or_default()
     }
 
     /// Select best service using load balancing strategy
     pub async fn select_service(&self, service_name: &str) -> Option<ServiceEndpoint> {
-        let healthy_services = self.get_healthy_services(service_name).await;
-
-        if healthy_services.is_empty() {
-            return None;
-        }
-
-        self.load_balancer
-            .select_service(&healthy_services, service_name)
-            .await
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get all services
     pub async fn get_all_services(&self) -> HashMap<String, Vec<ServiceEndpoint>> {
         self.services.read().await.clone()
     }
 
     /// Subscribe to service events
