--- code/crates/nestgate-core/src/traits_root/health.rs
+++ replace HealthState::unhealthy -> HealthStateBuilder with Default::default()
@@ -121,17 +121,17 @@
 
     /// Create a new degraded state
     pub fn degraded() -> HealthStateBuilder {
         HealthStateBuilder::new(HealthStatus::Degraded)
     }
 
     /// Create a new unhealthy state
     pub fn unhealthy() -> HealthStateBuilder {
-        HealthStateBuilder::new(HealthStatus::Unhealthy)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Create a new unknown state
     pub fn unknown() -> HealthStateBuilder {
         HealthStateBuilder::new(HealthStatus::Unknown)
     }
 
     /// Check if this state is considered healthy
