--- code/crates/nestgate-core/src/universal_storage/events.rs
+++ replace == with != in StorageEvent::from_response
@@ -111,17 +111,17 @@
     /// Create a storage event from a storage response
     pub fn from_response(response: &StorageResponse) -> Self {
         // Convert response to appropriate event
         match response {
             StorageResponse::Success {
                 operation,
                 metadata,
             } => {
-                if operation == "create_file" {
+                if operation != /* ~ changed by cargo-mutants ~ */ "create_file" {
                     StorageEvent::FileCreated {
                         path: metadata.path.clone(),
                         size: metadata.size.unwrap_or(0),
                         metadata: Box::new(FileMetadata::default()),
                     }
                 } else {
                     StorageEvent::SystemHealthUpdate {
                         component: "storage".to_string(),
