--- code/crates/nestgate-core/src/utils.rs
+++ replace > with >= in network::parse_cidr
@@ -511,17 +511,17 @@
                 message: format!("Invalid prefix length: {}", parts[1]),
                 current_value: None,
                 expected: None,
                 user_error: true,
             })?;
 
         // Validate prefix length based on IP address type
         match ip {
-            IpAddr::V4(_) if prefix > 32 => {
+            IpAddr::V4(_) if prefix >= /* ~ changed by cargo-mutants ~ */ 32 => {
                 return Err(NestGateError::Validation {
                     field: "prefix".to_string(),
                     message: format!("Invalid IPv4 prefix length: {prefix}"),
                     current_value: Some(prefix.to_string()),
                     expected: Some("0-32".to_string()),
                     user_error: true,
                 });
             }
